irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_rcc_4355_IUT.c
void RCC_ADCCLKConfig(uint32_t RCC_PCLK2);


 void RCC_I2S2CLKConfig(uint32_t RCC_I2S2CLKSource);
 void RCC_I2S3CLKConfig(uint32_t RCC_I2S3CLKSource);


void RCC_LSEConfig(uint8_t RCC_LSE);
void RCC_LSICmd(FunctionalState NewState);
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource);
void RCC_RTCCLKCmd(FunctionalState NewState);
void RCC_GetClocksFreq(RCC_ClocksTypeDef* RCC_Clocks);
void RCC_AHBPeriphClockCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState);
void RCC_APB2PeriphClockCmd(uint32_t RCC_APB2Periph, FunctionalState NewState);
void RCC_APB1PeriphClockCmd(uint32_t RCC_APB1Periph, FunctionalState NewState);


void RCC_AHBPeriphResetCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState);


void RCC_APB2PeriphResetCmd(uint32_t RCC_APB2Periph, FunctionalState NewState);
void RCC_APB1PeriphResetCmd(uint32_t RCC_APB1Periph, FunctionalState NewState);
void RCC_BackupResetCmd(FunctionalState NewState);
void RCC_ClockSecuritySystemCmd(FunctionalState NewState);
void RCC_MCOConfig(uint8_t RCC_MCO);
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG);
void RCC_ClearFlag(void);
ITStatus RCC_GetITStatus(uint8_t RCC_IT);
void RCC_ClearITPendingBit(uint8_t RCC_IT);
# 23 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c" 2
/* # 202 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
static volatile const uint8_t APBAHBPrescTable[16] = {0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};
static volatile const uint8_t ADCPrescTable[4] = {2, 4, 6, 8};
/* # 226 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_DeInit(void)
{ CODESCROLL_FUNC_BEGIN(238, (238, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable656,639) 

  
  CS_CMM_PROBE_NODE_STMT(140,5,0) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR |= (uint32_t)0x00000001;





  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR &= (uint32_t)0xF0FF0000;



  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR &= (uint32_t)0xFEF6FFFF;


  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR &= (uint32_t)0xFFFBFFFF;


  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR &= (uint32_t)0xFF80FFFF;



  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR &= (uint32_t)0xEBFFFFFF;


  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CIR = 0x00FF0000;


  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 = 0x00000000;
/* # 267 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/

CS_CMM_PROBE_NODE_STMT(140,4,1) 
 CODESCROLL_FUNC_END(238, 18, 267) } CODESCROLL_FUNC_END_RBRACE 
/* # 279 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_HSEConfig(uint32_t RCC_HSE)
{ CODESCROLL_FUNC_BEGIN(239, (239, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable657,640) 

  
  CS_CMM_PROBE_NODE_STMT(140,3,0) ((void)0);


  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR &= ((uint32_t)0xFFFEFFFF);

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR &= ((uint32_t)0xFFFBFFFF);

  
  CS_CMM_PROBE_NODE_STMT(140,2,1) switch(RCC_HSE)
  {
    case ((uint32_t)0x00010000): CS_CMM_PROBE_C1(641) 

      
      CS_CMM_PROBE_NODE_STMT(140,1,2) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR |= ((uint32_t)0x00010000);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_239_1) ;

    case ((uint32_t)0x00040000): CS_CMM_PROBE_C1(642) 

      
      CS_CMM_PROBE_NODE_STMT(140,0,3) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR |= ((uint32_t)0x00040000) | ((uint32_t)0x00010000);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_239_1) ;

    default: CS_CMM_PROBE_C1(643) 
      
      CS_CMM_PROBE_NODE_STMT(141,7,4) CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_239_1) ;
  } CS_CMM_LABEL(cs_cmm_switch_end_239_1) 

CS_CMM_PROBE_NODE_STMT(141,6,5) 
 CODESCROLL_FUNC_END(239, 18, 304) } CODESCROLL_FUNC_END_RBRACE 
/* # 313 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
ErrorStatus RCC_WaitForHSEStartUp(void)
{ CODESCROLL_FUNC_BEGIN(240, (240, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable658,644) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable659,141,5,0)

  volatile uint32_t StartUpCounter = 0;
  ErrorStatus status = ERROR;
  FlagStatus HSEStatus = RESET;


  CS_CMM_do(cs_cmm_do_start_240_2) 
  {CS_CMM_PROBE_NODE_DECL(CodeScrollVariable660,141,4,1)

  
    HSEStatus = RCC_GetFlagStatus(((uint8_t)0x31));
    StartUpCounter++;
  } CS_CMM_while_CX(26, 27, cs_cmm_do_start_240_2, cs_cmm_do_cond_240_2, cs_cmm_do_end_240_2, ( CS_CMM_PROBE_NODE_EXPR(141,3,2) CS_MCDC_240_0((StartUpCounter != ((uint16_t)0x0500)), (HSEStatus == RESET), 39)));

  
  CS_CMM_PROBE_NODE_STMT(141,2,3) if (RCC_GetFlagStatus(((uint8_t)0x31)) != RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable661,645) 
    
    CS_CMM_PROBE_NODE_STMT(141,1,4) status = SUCCESS;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable662,646) 
    
    CS_CMM_PROBE_NODE_STMT(141,0,5) status = ERROR;
  }
  
  CS_CMM_PROBE_NODE_STMT(142,7,6) 
   CODESCROLL_FUNC_END(240, 18, 334) return (status);
} CODESCROLL_FUNC_END_RBRACE 







void RCC_AdjustHSICalibrationValue(uint8_t HSICalibrationValue)
{ CODESCROLL_FUNC_BEGIN(241, (241, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable663,647) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable664,142,6,0)

