irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_rcc_4355_IUT.c
  uint32_t tmpreg = 0;

  ((void)0);
  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR;

  tmpreg &= ((uint32_t)0xFFFFFF07);

  tmpreg |= (uint32_t)HSICalibrationValue << 3;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR = tmpreg;

CS_CMM_PROBE_NODE_STMT(142,5,1) 
 CODESCROLL_FUNC_END(241, 18, 355) } CODESCROLL_FUNC_END_RBRACE 







void RCC_HSICmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(242, (242, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable665,648) 

  
  CS_CMM_PROBE_NODE_STMT(142,4,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x00 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(142,3,1) 
 CODESCROLL_FUNC_END(242, 18, 368) } CODESCROLL_FUNC_END_RBRACE 
/* # 387 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PLLConfig(uint32_t RCC_PLLSource, uint32_t RCC_PLLMul)
{ CODESCROLL_FUNC_BEGIN(243, (243, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable666,649) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable667,142,2,0)

  uint32_t tmpreg = 0;


  ((void)0);
  ((void)0);

  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR;

  tmpreg &= ((uint32_t)0xFFC2FFFF);

  tmpreg |= RCC_PLLSource | RCC_PLLMul;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR = tmpreg;

CS_CMM_PROBE_NODE_STMT(142,1,1) 
 CODESCROLL_FUNC_END(243, 18, 402) } CODESCROLL_FUNC_END_RBRACE 







void RCC_PLLCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(244, (244, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable668,650) 

  
  CS_CMM_PROBE_NODE_STMT(142,0,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x18 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(143,7,1) 
 CODESCROLL_FUNC_END(244, 18, 416) } CODESCROLL_FUNC_END_RBRACE 
/* # 435 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PREDIV1Config(uint32_t RCC_PREDIV1_Source, uint32_t RCC_PREDIV1_Div)
{ CODESCROLL_FUNC_BEGIN(245, (245, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable669,651) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable670,143,6,0)

  uint32_t tmpreg = 0;


  ((void)0);
  ((void)0);

  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2;

  tmpreg &= ~(((uint32_t)0x0000000F) | ((uint32_t)0x00010000));

  tmpreg |= RCC_PREDIV1_Source | RCC_PREDIV1_Div ;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 = tmpreg;

CS_CMM_PROBE_NODE_STMT(143,5,1) 
 CODESCROLL_FUNC_END(245, 18, 450) } CODESCROLL_FUNC_END_RBRACE 
/* # 463 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PREDIV2Config(uint32_t RCC_PREDIV2_Div)
{ CODESCROLL_FUNC_BEGIN(246, (246, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable671,652) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable672,143,4,0)

  uint32_t tmpreg = 0;


  ((void)0);

  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2;

  tmpreg &= ~((uint32_t)0x000000F0);

  tmpreg |= RCC_PREDIV2_Div;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 = tmpreg;

CS_CMM_PROBE_NODE_STMT(143,3,1) 
 CODESCROLL_FUNC_END(246, 18, 477) } CODESCROLL_FUNC_END_RBRACE 
/* # 488 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PLL2Config(uint32_t RCC_PLL2Mul)
{ CODESCROLL_FUNC_BEGIN(247, (247, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable673,653) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable674,143,2,0)

  uint32_t tmpreg = 0;


  ((void)0);

  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2;

  tmpreg &= ~((uint32_t)0x00000F00);

  tmpreg |= RCC_PLL2Mul;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 = tmpreg;

CS_CMM_PROBE_NODE_STMT(143,1,1) 
 CODESCROLL_FUNC_END(247, 18, 502) } CODESCROLL_FUNC_END_RBRACE 
/* # 514 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PLL2Cmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(248, (248, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable675,654) 

  
  CS_CMM_PROBE_NODE_STMT(143,0,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x1A * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(144,7,1) 
 CODESCROLL_FUNC_END(248, 18, 520) } CODESCROLL_FUNC_END_RBRACE 
/* # 532 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PLL3Config(uint32_t RCC_PLL3Mul)
{ CODESCROLL_FUNC_BEGIN(249, (249, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable676,655) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable677,144,6,0)

  uint32_t tmpreg = 0;


  ((void)0);

  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2;

  tmpreg &= ~((uint32_t)0x0000F000);

  tmpreg |= RCC_PLL3Mul;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 = tmpreg;

CS_CMM_PROBE_NODE_STMT(144,5,1) 
 CODESCROLL_FUNC_END(249, 18, 546) } CODESCROLL_FUNC_END_RBRACE 
/* # 555 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PLL3Cmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(250, (250, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable678,656) 


  
