irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_rcc_4355_IUT.c
  CS_CMM_PROBE_NODE_STMT(144,4,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x1C * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(144,3,1) 
 CODESCROLL_FUNC_END(250, 18, 561) } CODESCROLL_FUNC_END_RBRACE 
/* # 573 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_SYSCLKConfig(uint32_t RCC_SYSCLKSource)
{ CODESCROLL_FUNC_BEGIN(251, (251, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable679,657) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable680,144,2,0)

  uint32_t tmpreg = 0;

  ((void)0);
  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR;

  tmpreg &= ((uint32_t)0xFFFFFFFC);

  tmpreg |= RCC_SYSCLKSource;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR = tmpreg;

CS_CMM_PROBE_NODE_STMT(144,1,1) 
 CODESCROLL_FUNC_END(251, 18, 585) } CODESCROLL_FUNC_END_RBRACE 
/* # 596 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
uint8_t RCC_GetSYSCLKSource(void)
{ CODESCROLL_FUNC_BEGIN(252, (252, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable681,658) 
  
  CS_CMM_PROBE_NODE_STMT(144,0,0) 
  CS_CMM_PROBE_NODE_STMT(145,7,1) 
   CODESCROLL_FUNC_END(252, 18, 598) return ((uint8_t)(((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR & ((uint32_t)0x0000000C)));
} CODESCROLL_FUNC_END_RBRACE 
/* # 617 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_HCLKConfig(uint32_t RCC_SYSCLK)
{ CODESCROLL_FUNC_BEGIN(253, (253, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable682,659) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable683,145,6,0)

  uint32_t tmpreg = 0;

  ((void)0);
  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR;

  tmpreg &= ((uint32_t)0xFFFFFF0F);

  tmpreg |= RCC_SYSCLK;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR = tmpreg;

CS_CMM_PROBE_NODE_STMT(145,5,1) 
 CODESCROLL_FUNC_END(253, 18, 629) } CODESCROLL_FUNC_END_RBRACE 
/* # 643 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PCLK1Config(uint32_t RCC_HCLK)
{ CODESCROLL_FUNC_BEGIN(254, (254, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable684,660) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable685,145,4,0)

  uint32_t tmpreg = 0;

  ((void)0);
  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR;

  tmpreg &= ((uint32_t)0xFFFFF8FF);

  tmpreg |= RCC_HCLK;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR = tmpreg;

CS_CMM_PROBE_NODE_STMT(145,3,1) 
 CODESCROLL_FUNC_END(254, 18, 655) } CODESCROLL_FUNC_END_RBRACE 
/* # 669 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_PCLK2Config(uint32_t RCC_HCLK)
{ CODESCROLL_FUNC_BEGIN(255, (255, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable686,661) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable687,145,2,0)

  uint32_t tmpreg = 0;

  ((void)0);
  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR;

  tmpreg &= ((uint32_t)0xFFFFC7FF);

  tmpreg |= RCC_HCLK << 3;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR = tmpreg;

CS_CMM_PROBE_NODE_STMT(145,1,1) 
 CODESCROLL_FUNC_END(255, 18, 681) } CODESCROLL_FUNC_END_RBRACE 
/* # 709 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_ITConfig(uint8_t RCC_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(256, (256, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable688,662) 

  
  CS_CMM_PROBE_NODE_STMT(145,0,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(146,7,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable689,663) 

    
    CS_CMM_PROBE_NODE_STMT(146,6,2) *(volatile uint8_t *) ((uint32_t)0x40021009) |= RCC_IT;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable690,664) 

    
    CS_CMM_PROBE_NODE_STMT(146,5,3) *(volatile uint8_t *) ((uint32_t)0x40021009) &= (uint8_t)~RCC_IT;
  }

CS_CMM_PROBE_NODE_STMT(146,4,4) 
 CODESCROLL_FUNC_END(256, 18, 724) } CODESCROLL_FUNC_END_RBRACE 
/* # 755 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_OTGFSCLKConfig(uint32_t RCC_OTGFSCLKSource)
{ CODESCROLL_FUNC_BEGIN(257, (257, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable691,665) 

  
  CS_CMM_PROBE_NODE_STMT(146,3,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x04) * 32) + (0x16 * 4)) = RCC_OTGFSCLKSource;

CS_CMM_PROBE_NODE_STMT(146,2,1) 
 CODESCROLL_FUNC_END(257, 18, 761) } CODESCROLL_FUNC_END_RBRACE 
/* # 775 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_ADCCLKConfig(uint32_t RCC_PCLK2)
{ CODESCROLL_FUNC_BEGIN(258, (258, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable692,666) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable693,146,1,0)

  uint32_t tmpreg = 0;

  ((void)0);
  tmpreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR;

