irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_rcc_4355_IUT.c
  tmpreg &= ((uint32_t)0xFFFF3FFF);

  tmpreg |= RCC_PCLK2;

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR = tmpreg;

CS_CMM_PROBE_NODE_STMT(146,0,1) 
 CODESCROLL_FUNC_END(258, 18, 787) } CODESCROLL_FUNC_END_RBRACE 
/* # 801 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_I2S2CLKConfig(uint32_t RCC_I2S2CLKSource)
{ CODESCROLL_FUNC_BEGIN(259, (259, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable694,667) 

  
  CS_CMM_PROBE_NODE_STMT(147,7,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x2C) * 32) + (0x11 * 4)) = RCC_I2S2CLKSource;

CS_CMM_PROBE_NODE_STMT(147,6,1) 
 CODESCROLL_FUNC_END(259, 18, 807) } CODESCROLL_FUNC_END_RBRACE 
/* # 820 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_I2S3CLKConfig(uint32_t RCC_I2S3CLKSource)
{ CODESCROLL_FUNC_BEGIN(260, (260, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable695,668) 

  
  CS_CMM_PROBE_NODE_STMT(147,5,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x2C) * 32) + (0x12 * 4)) = RCC_I2S3CLKSource;

CS_CMM_PROBE_NODE_STMT(147,4,1) 
 CODESCROLL_FUNC_END(260, 18, 826) } CODESCROLL_FUNC_END_RBRACE 
/* # 838 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_LSEConfig(uint8_t RCC_LSE)
{ CODESCROLL_FUNC_BEGIN(261, (261, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable696,669) 

  
  CS_CMM_PROBE_NODE_STMT(147,3,0) ((void)0);


  *(volatile uint8_t *) (((uint32_t)0x40000000) + ((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x20)) = ((uint8_t)0x00);

  *(volatile uint8_t *) (((uint32_t)0x40000000) + ((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x20)) = ((uint8_t)0x00);

  
  CS_CMM_PROBE_NODE_STMT(147,2,1) switch(RCC_LSE)
  {
    case ((uint8_t)0x01): CS_CMM_PROBE_C1(670) 

      
      CS_CMM_PROBE_NODE_STMT(147,1,2) *(volatile uint8_t *) (((uint32_t)0x40000000) + ((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x20)) = ((uint8_t)0x01);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_261_1) ;

    case ((uint8_t)0x04): CS_CMM_PROBE_C1(671) 

      
      CS_CMM_PROBE_NODE_STMT(147,0,3) *(volatile uint8_t *) (((uint32_t)0x40000000) + ((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x20)) = ((uint8_t)0x04) | ((uint8_t)0x01);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_261_1) ;

    default: CS_CMM_PROBE_C1(672) 
      
      CS_CMM_PROBE_NODE_STMT(148,7,4) CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_261_1) ;
  } CS_CMM_LABEL(cs_cmm_switch_end_261_1) 

CS_CMM_PROBE_NODE_STMT(148,6,5) 
 CODESCROLL_FUNC_END(261, 18, 863) } CODESCROLL_FUNC_END_RBRACE 







void RCC_LSICmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(262, (262, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable697,673) 

  
  CS_CMM_PROBE_NODE_STMT(148,5,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x24) * 32) + (0x00 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(148,4,1) 
 CODESCROLL_FUNC_END(262, 18, 876) } CODESCROLL_FUNC_END_RBRACE 
/* # 888 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource)
{ CODESCROLL_FUNC_BEGIN(263, (263, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable698,674) 

  
  CS_CMM_PROBE_NODE_STMT(148,3,0) ((void)0);

  ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->BDCR |= RCC_RTCCLKSource;

CS_CMM_PROBE_NODE_STMT(148,2,1) 
 CODESCROLL_FUNC_END(263, 18, 894) } CODESCROLL_FUNC_END_RBRACE 







void RCC_RTCCLKCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(264, (264, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable699,675) 

  
  CS_CMM_PROBE_NODE_STMT(148,1,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x20) * 32) + (0x0F * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(148,0,1) 
 CODESCROLL_FUNC_END(264, 18, 907) } CODESCROLL_FUNC_END_RBRACE 







void RCC_GetClocksFreq(RCC_ClocksTypeDef* RCC_Clocks)
{ CODESCROLL_FUNC_BEGIN(265, (265, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable700,676) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable701,149,7,0)

  uint32_t tmp = 0, pllmull = 0, pllsource = 0, presc = 0;


  uint32_t prediv1source = 0, prediv1factor = 0, prediv2factor = 0, pll2mull = 0;







  tmp = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR & ((uint32_t)0x0000000C);

  
  CS_CMM_PROBE_NODE_STMT(149,6,1) switch (tmp)
  {
    case 0x00: CS_CMM_PROBE_C1(677) 
      
      CS_CMM_PROBE_NODE_STMT(149,5,2) RCC_Clocks->SYSCLK_Frequency = ((uint32_t)8000000);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_265_1) ;
    case 0x04: CS_CMM_PROBE_C1(678) 
      
      CS_CMM_PROBE_NODE_STMT(149,4,3) RCC_Clocks->SYSCLK_Frequency = ((uint32_t)25000000);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_265_1) ;
    case 0x08: CS_CMM_PROBE_C1(679) 


      
