irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_rcc_4355_IUT.c
      CS_CMM_PROBE_NODE_STMT(149,3,4) pllmull = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR & ((uint32_t)0x003C0000);
      pllsource = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR & ((uint32_t)0x00010000);
/* # 970 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
      pllmull = pllmull >> 18;

      
      CS_CMM_PROBE_NODE_STMT(149,2,5) if (pllmull != 0x0D)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable702,680) 
         
         CS_CMM_PROBE_NODE_STMT(149,1,6) pllmull += 2;
      }
      else
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable703,681) 
        
        CS_CMM_PROBE_NODE_STMT(149,0,7) pllmull = 13 / 2;
      }

      
      CS_CMM_PROBE_NODE_STMT(150,7,8) if (pllsource == 0x00)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable704,682) 
        
        CS_CMM_PROBE_NODE_STMT(150,6,9) RCC_Clocks->SYSCLK_Frequency = (((uint32_t)8000000) >> 1) * pllmull;
      }
      else
      {


        
        CS_CMM_PROBE_NODE_STMT(150,5,10) prediv1source = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 & ((uint32_t)0x00010000);
        prediv1factor = (((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 & ((uint32_t)0x0000000F)) + 1;

        
        CS_CMM_PROBE_NODE_STMT(150,4,11) if (prediv1source == 0)
        { CS_CMM_PROBE_DECL_C1(CodeScrollVariable705,683) 
          
          CS_CMM_PROBE_NODE_STMT(150,3,12) RCC_Clocks->SYSCLK_Frequency = (((uint32_t)25000000) / prediv1factor) * pllmull;
        }
        else
        { CS_CMM_PROBE_DECL_C1(CodeScrollVariable706,684) 


          
          CS_CMM_PROBE_NODE_STMT(150,2,13) prediv2factor = ((((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 & ((uint32_t)0x000000F0)) >> 4) + 1;
          pll2mull = ((((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 & ((uint32_t)0x00000F00)) >> 8 ) + 2;
          RCC_Clocks->SYSCLK_Frequency = (((((uint32_t)25000000) / prediv2factor) * pll2mull) / prediv1factor) * pllmull;
        }
      }

      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_265_1) ;

    default: CS_CMM_PROBE_C1(685) 
      
      CS_CMM_PROBE_NODE_STMT(150,1,14) RCC_Clocks->SYSCLK_Frequency = ((uint32_t)8000000);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_265_1) ;
  } CS_CMM_LABEL(cs_cmm_switch_end_265_1) 



  
  CS_CMM_PROBE_NODE_STMT(150,0,15) tmp = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR & ((uint32_t)0x000000F0);
  tmp = tmp >> 4;
  presc = APBAHBPrescTable[tmp];

  RCC_Clocks->HCLK_Frequency = RCC_Clocks->SYSCLK_Frequency >> presc;

  tmp = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR & ((uint32_t)0x00000700);
  tmp = tmp >> 8;
  presc = APBAHBPrescTable[tmp];

  RCC_Clocks->PCLK1_Frequency = RCC_Clocks->HCLK_Frequency >> presc;

  tmp = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR & ((uint32_t)0x00003800);
  tmp = tmp >> 11;
  presc = APBAHBPrescTable[tmp];

  RCC_Clocks->PCLK2_Frequency = RCC_Clocks->HCLK_Frequency >> presc;

  tmp = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR & ((uint32_t)0x0000C000);
  tmp = tmp >> 14;
  presc = ADCPrescTable[tmp];

  RCC_Clocks->ADCCLK_Frequency = RCC_Clocks->PCLK2_Frequency / presc;

CS_CMM_PROBE_NODE_STMT(151,7,16) 
 CODESCROLL_FUNC_END(265, 18, 1038) } CODESCROLL_FUNC_END_RBRACE 
/* # 1071 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_AHBPeriphClockCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(266, (266, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable707,686) 

  
  CS_CMM_PROBE_NODE_STMT(151,6,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(151,5,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable708,687) 
    
    CS_CMM_PROBE_NODE_STMT(151,4,2) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->AHBENR |= RCC_AHBPeriph;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable709,688) 
    
    CS_CMM_PROBE_NODE_STMT(151,3,3) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->AHBENR &= ~RCC_AHBPeriph;
  }

CS_CMM_PROBE_NODE_STMT(151,2,4) 
 CODESCROLL_FUNC_END(266, 18, 1085) } CODESCROLL_FUNC_END_RBRACE 
/* # 1102 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_APB2PeriphClockCmd(uint32_t RCC_APB2Periph, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(267, (267, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable710,689) 

  
  CS_CMM_PROBE_NODE_STMT(151,1,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(151,0,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable711,690) 
    
    CS_CMM_PROBE_NODE_STMT(152,7,2) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->APB2ENR |= RCC_APB2Periph;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable712,691) 
    
    CS_CMM_PROBE_NODE_STMT(152,6,3) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->APB2ENR &= ~RCC_APB2Periph;
  }

CS_CMM_PROBE_NODE_STMT(152,5,4) 
 CODESCROLL_FUNC_END(267, 18, 1115) } CODESCROLL_FUNC_END_RBRACE 
/* # 1133 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_APB1PeriphClockCmd(uint32_t RCC_APB1Periph, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(268, (268, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable713,692) 

  
  CS_CMM_PROBE_NODE_STMT(152,4,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(152,3,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable714,693) 
    
    CS_CMM_PROBE_NODE_STMT(152,2,2) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->APB1ENR |= RCC_APB1Periph;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable715,694) 
    
    CS_CMM_PROBE_NODE_STMT(152,1,3) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->APB1ENR &= ~RCC_APB1Periph;
  }

