irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_rcc_4355_IUT.c
CS_CMM_PROBE_NODE_STMT(152,0,4) 
 CODESCROLL_FUNC_END(268, 18, 1146) } CODESCROLL_FUNC_END_RBRACE 
/* # 1160 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_AHBPeriphResetCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(269, (269, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable716,695) 

  
  CS_CMM_PROBE_NODE_STMT(153,7,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(153,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable717,696) 
    
    CS_CMM_PROBE_NODE_STMT(153,5,2) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->AHBRSTR |= RCC_AHBPeriph;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable718,697) 
    
    CS_CMM_PROBE_NODE_STMT(153,4,3) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->AHBRSTR &= ~RCC_AHBPeriph;
  }

CS_CMM_PROBE_NODE_STMT(153,3,4) 
 CODESCROLL_FUNC_END(269, 18, 1174) } CODESCROLL_FUNC_END_RBRACE 
/* # 1192 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_APB2PeriphResetCmd(uint32_t RCC_APB2Periph, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(270, (270, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable719,698) 

  
  CS_CMM_PROBE_NODE_STMT(153,2,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(153,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable720,699) 
    
    CS_CMM_PROBE_NODE_STMT(153,0,2) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->APB2RSTR |= RCC_APB2Periph;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable721,700) 
    
    CS_CMM_PROBE_NODE_STMT(154,7,3) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->APB2RSTR &= ~RCC_APB2Periph;
  }

CS_CMM_PROBE_NODE_STMT(154,6,4) 
 CODESCROLL_FUNC_END(270, 18, 1205) } CODESCROLL_FUNC_END_RBRACE 
/* # 1223 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_APB1PeriphResetCmd(uint32_t RCC_APB1Periph, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(271, (271, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable722,701) 

  
  CS_CMM_PROBE_NODE_STMT(154,5,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(154,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable723,702) 
    
    CS_CMM_PROBE_NODE_STMT(154,3,2) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->APB1RSTR |= RCC_APB1Periph;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable724,703) 
    
    CS_CMM_PROBE_NODE_STMT(154,2,3) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->APB1RSTR &= ~RCC_APB1Periph;
  }

CS_CMM_PROBE_NODE_STMT(154,1,4) 
 CODESCROLL_FUNC_END(271, 18, 1236) } CODESCROLL_FUNC_END_RBRACE 







void RCC_BackupResetCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(272, (272, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable725,704) 

  
  CS_CMM_PROBE_NODE_STMT(154,0,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x20) * 32) + (0x10 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(155,7,1) 
 CODESCROLL_FUNC_END(272, 18, 1249) } CODESCROLL_FUNC_END_RBRACE 







void RCC_ClockSecuritySystemCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(273, (273, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable726,705) 

  
  CS_CMM_PROBE_NODE_STMT(155,6,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x20000) + 0x1000) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x13 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(155,5,1) 
 CODESCROLL_FUNC_END(273, 18, 1262) } CODESCROLL_FUNC_END_RBRACE 
/* # 1289 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_MCOConfig(uint8_t RCC_MCO)
{ CODESCROLL_FUNC_BEGIN(274, (274, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable727,706) 

  
  CS_CMM_PROBE_NODE_STMT(155,4,0) ((void)0);


  *(volatile uint8_t *) ((uint32_t)0x40021007) = RCC_MCO;

CS_CMM_PROBE_NODE_STMT(155,3,1) 
 CODESCROLL_FUNC_END(274, 18, 1296) } CODESCROLL_FUNC_END_RBRACE 
/* # 1333 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG)
{ CODESCROLL_FUNC_BEGIN(275, (275, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable728,707) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable729,155,2,0)

  uint32_t tmp = 0;
  uint32_t statusreg = 0;
  FlagStatus bitstatus = RESET;

  ((void)0);


  tmp = RCC_FLAG >> 5;
  
  CS_CMM_PROBE_NODE_STMT(155,1,1) if (tmp == 1)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable730,708) 
    
    CS_CMM_PROBE_NODE_STMT(155,0,2) statusreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CR;
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(156,7,3) if (tmp == 2)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable731,709) 
    
    CS_CMM_PROBE_NODE_STMT(156,6,4) statusreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->BDCR;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable732,710) 
    
    CS_CMM_PROBE_NODE_STMT(156,5,5) statusreg = ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CSR;
  }
  }


  
  CS_CMM_PROBE_NODE_STMT(156,4,6) tmp = RCC_FLAG & ((uint8_t)0x1F);
  
