irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_rcc_4355_IUT.c
  CS_CMM_PROBE_NODE_STMT(156,3,7) if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable733,711) 
    
    CS_CMM_PROBE_NODE_STMT(156,2,8) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable734,712) 
    
    CS_CMM_PROBE_NODE_STMT(156,1,9) bitstatus = RESET;
  }


  
  CS_CMM_PROBE_NODE_STMT(156,0,10) 
   CODESCROLL_FUNC_END(275, 18, 1368) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1378 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_ClearFlag(void)
{ CODESCROLL_FUNC_BEGIN(276, (276, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable735,713) 

  
  CS_CMM_PROBE_NODE_STMT(157,7,0) ((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CSR |= ((uint32_t)0x01000000);

CS_CMM_PROBE_NODE_STMT(157,6,1) 
 CODESCROLL_FUNC_END(276, 18, 1382) } CODESCROLL_FUNC_END_RBRACE 
/* # 1409 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
ITStatus RCC_GetITStatus(uint8_t RCC_IT)
{ CODESCROLL_FUNC_BEGIN(277, (277, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable736,714) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable737,157,5,0)

  ITStatus bitstatus = RESET;

  ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(157,4,1) if ((((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CIR & RCC_IT) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable738,715) 
    
    CS_CMM_PROBE_NODE_STMT(157,3,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable739,716) 
    
    CS_CMM_PROBE_NODE_STMT(157,2,3) bitstatus = RESET;
  }


  
  CS_CMM_PROBE_NODE_STMT(157,1,4) 
   CODESCROLL_FUNC_END(277, 18, 1426) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1455 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rcc.c"*/
void RCC_ClearITPendingBit(uint8_t RCC_IT)
{ CODESCROLL_FUNC_BEGIN(278, (278, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable740,717) 

  
  CS_CMM_PROBE_NODE_STMT(157,0,0) ((void)0);



  *(volatile uint8_t *) ((uint32_t)0x4002100A) = RCC_IT;

CS_CMM_PROBE_NODE_STMT(158,7,1) 
 CODESCROLL_FUNC_END(278, 18, 1463) } CODESCROLL_FUNC_END_RBRACE 
